"""
XPath Objects cho màn hình: マーケット
Package: inc.guide.sbi.fx.dev
Thời gian: 2025-07-28 10:35:17
"""

class CurrentScreenXPaths:
    """XPath objects cho màn hình hiện tại"""

    ELEMENT_1 = "(//*[@class='android.widget.ImageView'])[1]"
    レートタブ_14 = "//*[@content-desc='レート
タブ: 1/4']"
    スワップタブ_24 = "//*[@content-desc='スワップ
タブ: 2/4']"
    ニュースタブ_34 = "//*[@content-desc='ニュース
タブ: 3/4']"
    経済指標タブ_44 = "//*[@content-desc='経済指標
タブ: 4/4']"
    タブ_12 = "//*[@content-desc='タブ: 1/2']"
    レート小 = "//*[@content-desc='レート小']"
    タブ_22 = "//*[@content-desc='タブ: 2/2']"
    レート大 = "//*[@content-desc='レート大']"
    米ドル_円146086高値170999SW_売買_11704146090安値107999前日比_67 = "//*[@content-desc='米ドル-円
146.086
高値
170.999
SW 売/買
-11/7
0.4
146.090
安値
107.999
前日比
-6.710']"
    ユーロ_円122915高値166996SW_売買8_13100123015安値122963前日比_3 = "//*[@content-desc='ユーロ-円
122.915
高値
166.996
SW 売/買
8/-13
10.0
123.015
安値
122.963
前日比
-36.858']"
    ポンド_円190029高値192508SW_売買_9409190038安値189701前日比_185 = "//*[@content-desc='ポンド-円
190.029
高値
192.508
SW 売/買
-9/4
0.9
190.038
安値
189.701
前日比
-1.856']"
    豪ドル_円98529高値98698SW_売買_610698535安値96325前日比2023 = "//*[@content-desc='豪ドル-円
98.529
高値
98.698
SW 売/買
-6/1
0.6
98.535
安値
96.325
前日比
+2.023']"
    ﾒｷｼｺﾍﾟｿ_円7808高値8197SW_売買_85037811安値7463前日比0325 = "//*[@content-desc='ﾒｷｼｺﾍﾟｿ-円
7.808
高値
8.197
SW 売/買
-8/5
0.3
7.811
安値
7.463
前日比
+0.325']"
    南アランド_円8421高値8697SW_売買_129098430安値8201前日比0161 = "//*[@content-desc='南アランド-円
8.421
高値
8.697
SW 売/買
-12/9
0.9
8.430
安値
8.201
前日比
+0.161']"
    トルコリラ_円4618高値4798SW_売買_5343284646安値4195前日比0415 = "//*[@content-desc='トルコリラ-円
4.618
高値
4.798
SW 売/買
-53/43
2.8
4.646
安値
4.195
前日比
+0.415']"
    マーケット = "//*[@content-desc='マーケット']"
    チャート = "//*[@content-desc='チャート']"
    スピード注文 = "//*[@content-desc='スピード注文']"
    ログイン = "//*[@content-desc='ログイン']"
    ウェブサイト = "//*[@content-desc='ウェブサイト']"
    メニュー = "//*[@content-desc='メニュー']"
    マーケット = "//*[@content-desc='マーケット']"
    通貨ペア売BID買ASK = "//*[@content-desc='通貨ペア
売(Bid)
買(Ask)']"

    # Thông tin màn hình
    SCREEN_NAME = "マーケット"
    PACKAGE_NAME = "inc.guide.sbi.fx.dev"
    TIMESTAMP = "20250728_103517"
